src/toir_cfe/src/Documents/проф_КорректировкаЗапасовИПотребностей/проф_КорректировкаЗапасовИПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="74d8fe1a-5251-4bdb-89a0-e4feac5b4dbb">
  <name>проф_КорректировкаЗапасовИПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="df140200-b4e7-404e-9106-49eb4fd2351b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="197d0ecc-e7ae-4048-8b02-e9c3ebc142fa">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d4274bb-7aec-44b0-ac86-8f45e60bdde5">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e20cc3e5-c658-4334-b655-4db6639b949d">
    <name>ПричинаКорректировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d82a704-6d13-4848-abeb-95bc0edf2814">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4a5f5e5-1fae-4331-b40b-c2d0bd833620">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f66dc17e-6ee9-489c-a7ec-d40d3d955c64">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2fc68760-255e-4c33-85a5-98e11f540114">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8187ba36-cc68-4e95-beef-6a1bca68866a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4f1031b7-f248-42a4-bb5b-e07f817b25ea">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be94bc88-9479-47e3-9a3f-e3bff1f5f5bc">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5b5afc34-0737-4f64-8dd5-fa057dff679e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04c20f66-e44e-4c0b-b21f-ed44a2d0a107">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59bd9b14-1cd9-4f15-99e6-4308443b90be">
      <name>ВНаличии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="542edf58-946d-421b-9acc-22e93c70c077">
      <name>Заказано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f0b2692-9640-4e0c-8240-7aa004fe7c69">
      <name>КОбеспечению</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b4203d6d-a8e3-4a94-b6fc-b1eff93c6167">
      <name>НеОбеспечивать</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d7bdd85b-3236-4718-8228-70db30702dd4">
      <name>ОтложитьРезервирование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e004ed37-af33-41bc-894d-f3b14778b226">
      <name>Поступит</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="18b8ab75-204f-4f67-87f4-f086f9201f89">
      <name>РезервироватьНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bde86844-9f05-4c74-87a4-bc6b13e9eac8">
      <name>РезервироватьПоМереПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/проф_КорректировкаЗапасовИПотребностей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// ++ Проф-ИТ, #180, Сергеев Д., 19.09.2023

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапроспроф_ЗапасыИПотребности(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапроспроф_ЗапасыИПотребности(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "проф_ЗапасыИПотребности";
	
	Если НЕ ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	проф_КорректировкаЗапасовИПотребностей.Ссылка КАК Ссылка,
	|	проф_КорректировкаЗапасовИПотребностей.Склад КАК Склад,
	|	проф_КорректировкаЗапасовИПотребностей.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА проф_КорректировкаЗапасовИПотребностей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.торо_ВидыОперацийКорректировкиОстатков.Списание)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	проф_КорректировкаЗапасовИПотребностейТовары.Номенклатура КАК Номенклатура,
	|	проф_КорректировкаЗапасовИПотребностейТовары.Характеристика КАК Характеристика,
	|	проф_КорректировкаЗапасовИПотребностейТовары.Назначение КАК Назначение,
	|	проф_КорректировкаЗапасовИПотребностейТовары.ВНаличии КАК ВНаличии,
	|	проф_КорректировкаЗапасовИПотребностейТовары.Заказано КАК Заказано,
	|	проф_КорректировкаЗапасовИПотребностейТовары.КОбеспечению КАК КОбеспечению,
	|	проф_КорректировкаЗапасовИПотребностейТовары.НеОбеспечивать КАК НеОбеспечивать,
	|	проф_КорректировкаЗапасовИПотребностейТовары.ОтложитьРезервирование КАК ОтложитьРезервирование,
	|	проф_КорректировкаЗапасовИПотребностейТовары.Поступит КАК Поступит,
	|	проф_КорректировкаЗапасовИПотребностейТовары.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
	|	проф_КорректировкаЗапасовИПотребностейТовары.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления
	|ИЗ
	|	Документ.проф_КорректировкаЗапасовИПотребностей КАК проф_КорректировкаЗапасовИПотребностей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.проф_КорректировкаЗапасовИПотребностей.Товары КАК проф_КорректировкаЗапасовИПотребностейТовары
	|		ПО (проф_КорректировкаЗапасовИПотребностейТовары.Ссылка = проф_КорректировкаЗапасовИПотребностей.Ссылка)
	|ГДЕ
	|	проф_КорректировкаЗапасовИПотребностей.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры)

	Если ЗначениеЗаполнено(Регистры) Тогда
		
		Если ТипЗнч(Регистры) = Тип("Строка") Тогда
			МассивРегистров = Новый Структура(Регистры);
		Иначе
			МассивРегистров = Регистры;
		КонецЕсли;
		
		Если НЕ МассивРегистров.Свойство(ИмяРегистра) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

// -- Проф-ИТ, #180, Сергеев Д., 19.09.2023

#КонецОбласти

#КонецОбласти

#КонецЕсли
